#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_vpc.default_vpc: Reading...
data.aws_subnet.subnet_us-east-1b: Reading...
aws_vpc.gl_vpc: Refreshing state... [id=vpc-04951f0170fd08dc0]
aws_security_group.securitygrp1: Refreshing state... [id=sg-008cfff7766ed6cb7]
data.aws_subnet.subnet_us-east-1a: Reading...
data.aws_subnet.subnet_us-east-1a: Read complete after 1s [id=subnet-0275b87dfa0212136]
data.aws_subnet.subnet_us-east-1b: Read complete after 1s [id=subnet-0893f1760ba7fe0c3]
aws_security_group_rule.allow_alb_all_outbound: Refreshing state... [id=sgrule-2471982566]
aws_security_group_rule.allow_http_inbound: Refreshing state... [id=sgrule-3476103746]
aws_security_group_rule.allow_alb_http_inbound: Refreshing state... [id=sgrule-2265051870]
aws_security_group_rule.ssh-rule: Refreshing state... [id=sgrule-831237995]
aws_lb.load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:loadbalancer/app/web-lb/11a3268a864e33ab]
aws_instance.academy_instance2: Refreshing state... [id=i-0b0b7320d0fe1b915]
aws_instance.academy_instance1: Refreshing state... [id=i-03c159e340dc438af]
data.aws_vpc.default_vpc: Read complete after 1s [id=vpc-0296796e930d1a837]
aws_lb_target_group.academy_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:targetgroup/web-tg/5ec9bdd67038cc15]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:listener/app/web-lb/11a3268a864e33ab/5cf4840dd8c28af4]
aws_subnet.public_subnet: Refreshing state... [id=subnet-0d93e21193d462bca]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0fa9bc89bb6b92fd1]
aws_internet_gateway.gl_igw: Refreshing state... [id=igw-013a5ef1412f76a9c]
aws_subnet.private_subnet: Refreshing state... [id=subnet-0965e19f45cdc7622]
aws_security_group.public_sg: Refreshing state... [id=sg-0edb6d6e8d33f1da2]
aws_lb_listener_rule.instances: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:listener-rule/app/web-lb/11a3268a864e33ab/5cf4840dd8c28af4/fe7f4db65e974d47]
aws_route.public_route: Refreshing state... [id=r-rtb-0fa9bc89bb6b92fd11080289494]
aws_route_table_association.public_subnet_association: Refreshing state... [id=rtbassoc-07b4949d6e401d294]
aws_security_group.private_sg: Refreshing state... [id=sg-0e285dfe8cc47c47b]
aws_instance.public_instance: Refreshing state... [id=i-0e505252116011475]
aws_instance.private_instance: Refreshing state... [id=i-0be01b0550d45d5af]
aws_lb_target_group_attachment.academy_tg_attach2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:targetgroup/web-tg/5ec9bdd67038cc15-20231118100850115600000006]
aws_lb_target_group_attachment.academy_tg_attach1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:targetgroup/web-tg/5ec9bdd67038cc15-20231118100849932900000005]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.academy_instance1 must be replaced
-/+ resource "aws_instance" "academy_instance1" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:758836510411:instance/i-03c159e340dc438af" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-03c159e340dc438af" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-094dc828ba11c1723" -> (known after apply)
      ~ private_dns                          = "ip-172-31-34-112.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.34.112" -> (known after apply)
      ~ public_dns                           = "ec2-3-86-48-242.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.86.48.242" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "private-sg",
        ] -> (known after apply) # forces replacement
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "name" = "httpserver1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-008cfff7766ed6cb7",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-05dfa5b381b9f2264" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.academy_instance2 must be replaced
-/+ resource "aws_instance" "academy_instance2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:758836510411:instance/i-0b0b7320d0fe1b915" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0b0b7320d0fe1b915" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-02ec45b63a7bcc5a4" -> (known after apply)
      ~ private_dns                          = "ip-172-31-14-81.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.14.81" -> (known after apply)
      ~ public_dns                           = "ec2-3-235-150-218.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.235.150.218" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "private-sg",
        ] -> (known after apply) # forces replacement
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "name" = "httpserver2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-008cfff7766ed6cb7",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-00978e6a1fa65af56" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_lb.load_balancer will be updated in-place
  ~ resource "aws_lb" "load_balancer" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:758836510411:loadbalancer/app/web-lb/11a3268a864e33ab"
        name                                        = "web-lb"
      ~ security_groups                             = [
          - "sg-008cfff7766ed6cb7",
        ] -> (known after apply)
        tags                                        = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb_target_group_attachment.academy_tg_attach1 must be replaced
-/+ resource "aws_lb_target_group_attachment" "academy_tg_attach1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:758836510411:targetgroup/web-tg/5ec9bdd67038cc15-20231118100849932900000005" -> (known after apply)
      ~ target_id        = "i-03c159e340dc438af" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.academy_tg_attach2 must be replaced
-/+ resource "aws_lb_target_group_attachment" "academy_tg_attach2" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:758836510411:targetgroup/web-tg/5ec9bdd67038cc15-20231118100850115600000006" -> (known after apply)
      ~ target_id        = "i-0b0b7320d0fe1b915" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_security_group.securitygrp1 must be replaced
-/+ resource "aws_security_group" "securitygrp1" {
      ~ arn                    = "arn:aws:ec2:us-east-1:758836510411:security-group/sg-008cfff7766ed6cb7" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-008cfff7766ed6cb7" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ name                   = "private-sg" -> "private-sg1" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "758836510411" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-0296796e930d1a837" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_security_group_rule.allow_alb_all_outbound must be replaced
-/+ resource "aws_security_group_rule" "allow_alb_all_outbound" {
      ~ id                       = "sgrule-2471982566" -> (known after apply)
      ~ security_group_id        = "sg-008cfff7766ed6cb7" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0aed90fb93ff651f3" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.allow_alb_http_inbound must be replaced
-/+ resource "aws_security_group_rule" "allow_alb_http_inbound" {
      ~ id                       = "sgrule-2265051870" -> (known after apply)
      ~ security_group_id        = "sg-008cfff7766ed6cb7" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-08d1c99587945dcec" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.allow_http_inbound must be replaced
-/+ resource "aws_security_group_rule" "allow_http_inbound" {
      ~ id                       = "sgrule-3476103746" -> (known after apply)
      ~ security_group_id        = "sg-008cfff7766ed6cb7" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0f8eef1208f059cd4" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.ssh-rule must be replaced
-/+ resource "aws_security_group_rule" "ssh-rule" {
      ~ id                       = "sgrule-831237995" -> (known after apply)
      ~ security_group_id        = "sg-008cfff7766ed6cb7" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-06d0e945e895e9183" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 9 to add, 1 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Gracemade21, Action: `pull_request`*